{
    "name": "Earth",
    "name_theory": "The name \"Earth\" is derived from Old English and Germanic words meaning \"ground\" or \"soil.\" It's believed that the name originates from the Anglo-Saxon word 'erda,' which refers to the ground or soil, emphasizing the planet's solid surface.",
    "description": "Earth is the third planet from the Sun and the only known planet to support life. It is the densest and fifth-largest of the eight planets in the Solar System.",
    "body_type": "Planet",
    "wiki_link": "https://en.wikipedia.org/wiki/Earth",
    "distance_from_earth": "0 km",
    "distance_from_nearest_star": "Approximately 149.6 million kilometers from Earth to the Sun",
    "radius": "6,371 km",
    "size_compared_to_earth": "1.0 (same size)",
    "mass": "5.972 × 10^24 kg",
    "density": "5.514 g/cm³",
    "rotation_period": "23.93 hours (24 hours on average)",
    "revolution_period": "365.25 days (1 year)",
    "axial_tilt": "23.5 degrees",
    "max_temprature": "58°C (136.4°F) recorded in Al 'Aziziyah, Libya",
    "min_temprature": "-89.2°C (-128.6°F) recorded at Vostok Station, Antarctica",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/22/Earth_Western_Hemisphere_transparent_background.png/1200px-Earth_Western_Hemisphere_transparent_background.png",
    "gallery": [
        {
            "image": "https://example.com/earth_surface.jpg",
            "description": "Earth's surface showing continents and oceans"
        },
        {
            "image": "https://example.com/earth_from_space.jpg",
            "description": "Earth as seen from space"
        }
    ],
    "3d_model": "https://example.com/earth_3d_model",
    "parent_solar_system": "Solar System",
    "galaxy": "Milky Way",
    "SEPHI": "1.0",
    "moon_count": 1,
    "moons": [
        {
            "name": "Moon",
            "image": "https://pngimg.com/d/moon_PNG3.png",
            "distance": "384,400 kilometers",
            "radius": "1,737.5 kilometers"
        }
    ],
    "interesting_facts": [
        "Earth is the only known planet to support life, with a rich diversity of ecosystems and organisms.",
        "Earth's atmosphere is composed of approximately 78% nitrogen, 21% oxygen, and traces of other gases.",
        "Earth's surface is covered by approximately 71% water, mostly in the form of oceans.",
        "Earth has a magnetic field that protects it from harmful solar radiation and cosmic rays.",
        "Earth has one natural satellite, the Moon, which plays a significant role in tides and stabilizing Earth's rotation.",
        "Earth experiences four seasons—spring, summer, autumn (fall), and winter—due to its axial tilt and orbit around the Sun.",
        "Earth's rotation on its axis causes day and night cycles, with each rotation taking approximately 24 hours.",
        "Earth's orbit around the Sun is nearly circular, with a slightly elliptical shape, resulting in a year of 365.25 days.",
        "Earth has a diverse range of climates and ecosystems, from deserts to rainforests and polar regions.",
        "Earth has a liquid outer core and a solid inner core, composed mostly of iron and nickel.",
        "Earth's atmosphere protects life on the planet by trapping heat and moderating temperature extremes.",
        "Earth's ozone layer absorbs harmful ultraviolet radiation from the Sun, crucial for protecting life from damage.",
        "Earth has a unique system of plate tectonics, with the Earth's crust divided into several large and small tectonic plates that interact and cause earthquakes and volcanic activity.",
        "Earth is the only known planet where water exists in all three states: solid (ice), liquid (water), and gas (water vapor).",
        "Earth's biosphere comprises the combined ecosystems of the planet, including living organisms and their environments.",
        "Earth's gravity is approximately 9.8 m/s² (32.2 ft/s²) at its surface, providing the force that keeps objects grounded.",
        "Earth's Moon is the fifth-largest moon in the Solar System and is thought to have formed from debris ejected during a collision between Earth and another celestial body.",
        "Earth's climate is influenced by various factors, including solar radiation, atmospheric composition, and ocean currents.",
        "Earth's oceans contain about 97% of the planet's water, with the remaining 3% found in glaciers, ice caps, and freshwater sources.",
        "Earth's rotation is gradually slowing due to tidal forces from the Moon, resulting in longer days over geological time scales."
    ],
    "atmospheric_composition": [
        {
            "element": "Nitrogen",
            "amount": "78.08%"
        },
        {
            "element": "Oxygen",
            "amount": "20.95%"
        },
        {
            "element": "Argon",
            "amount": "0.93%"
        },
        {
            "element": "Carbon Dioxide",
            "amount": "0.04%"
        },
        {
            "element": "Other gases",
            "amount": "< 0.01%"
        }
    ]
}