{
    "name": "Mercury",
    "name_theory": "Mercury is named after the Roman messenger god, known for his speed and agility. The planet moves swiftly across the sky, which likely inspired its association with the swift messenger of the gods.",
    "description": "Mercury is the smallest and innermost planet in the Solar System. It is named after the Roman deity Mercury, the messenger to the gods.",
    "body_type": "Planet",
    "wiki_link": "https://en.wikipedia.org/wiki/Mercury_(planet)",
    "distance_from_earth": "Approximately 77 million kilometers on average",
    "distance_from_nearest_star": "Approximately 46 million kilometers from Mercury to the Sun",
    "radius": "2,439.7 km",
    "size_compared_to_earth": "0.383 times the diameter of Earth",
    "mass": "3.3011 × 10^23 kg",
    "density": "5.427 g/cm³",
    "rotation_period": "58.6 Earth days",
    "revolution_period": "88 Earth days",
    "axial_tilt": "0.034 degrees",
    "max_temprature": "427°C (800°F) on the side facing the Sun",
    "min_temprature": "-173°C (-280°F) on the side facing away from the Sun",
    "image": "https://assets.stickpng.com/images/580b585b2edbce24c47b2709.png",
    "gallery": [
        {
            "image": "https://example.com/mercury_surface.jpg",
            "description": "Surface of Mercury showing craters and plains"
        },
        {
            "image": "https://example.com/mercury_orbit.jpg",
            "description": "Orbit of Mercury around the Sun"
        }
    ],
    "3d_model": "https://example.com/mercury_3d_model",
    "parent_solar_system": "Solar System",
    "galaxy": "Milky Way",
    "SEPHI": "0.38",
    "moon_count": 0,
    "moons": [],
    "interesting_facts": [
        "Mercury has the shortest orbit around the Sun of any planet in the Solar System.",
        "Mercury's surface is heavily cratered, resembling the Moon's surface.",
        "Mercury has a very thin atmosphere composed mainly of oxygen, sodium, hydrogen, helium, and potassium.",
        "Mercury has no moons.",
        "Mercury's surface experiences extreme temperature variations due to its lack of atmosphere.",
        "Mercury's rotation is unique; it completes three rotations about its axis for every two orbits around the Sun.",
        "The Caloris Basin on Mercury is one of the largest impact basins in the Solar System.",
        "Mercury's surface is covered in plains that are believed to be formed by volcanic activity.",
        "Mercury's orbit is the most eccentric of all the planets in the Solar System, meaning it is the most elongated.",
        "Mercury has been visited by spacecraft, including the MESSENGER mission, which provided detailed observations of the planet.",
        "Mercury is difficult to observe from Earth due to its proximity to the Sun, making it visible only during specific times.",
        "The surface temperature of Mercury can reach over 400°C (752°F) during the day and drop to -180°C (-292°F) at night.",
        "Mercury's core is proportionally larger than that of any other planet, comprising about 85% of its radius.",
        "Mercury's surface is scarred by cliffs and faults caused by the planet's contraction as its core cooled.",
        "Mercury is named after the Roman messenger god because of its fast orbit around the Sun.",
        "The smallest planet in the Solar System, Mercury is only slightly larger than Earth's moon.",
        "Mercury has a magnetic field, though much weaker than Earth's.",
        "Mercury's orbit is inclined by about 7 degrees to the plane of Earth's orbit around the Sun.",
        "Mercury is one of the five planets visible to the naked eye from Earth.",
        "Mercury has been known since ancient times, with observations dating back thousands of years."
    ],
    "atmospheric_composition": [
        {
            "element": "Oxygen",
            "amount": "42%"
        },
        {
            "element": "Sodium",
            "amount": "29%"
        },
        {
            "element": "Hydrogen",
            "amount": "22%"
        },
        {
            "element": "Helium",
            "amount": "6%"
        },
        {
            "element": "Potassium",
            "amount": "0.5%"
        },
        {
            "element": "Other gases",
            "amount": "< 0.5%"
        }
    ]
}