{
    "name": "Mercury",
    "name_theory": "The Romans knew of seven bright objects in the sky: the Sun, the Moon, and the five brightest planets. They named them after their most important gods. Because Mercury was the fastest planet as it moved around the Sun, it was named after the Roman messenger god Mercury",
    "description": "",
    "body_type": "Planet",
    "wiki_link": "https://en.wikipedia.org/wiki/Mercury_(planet)",
    "table_stats": {
        "diameter": "4880 km approx",
        "orbital_period": "88 days",
        "rotation_period": "59 days",
        "surface_temprature": "-173°c to 427°c",
        "distance_from_sun": "57.9 million Km",
        "distance_from_earth": "77 million km",
        "gravity": "38% of Earth",
        "magnetic_field": "1% of Earth",
        "moon_count": "0",
        "length_of_day": "176 day",
        "orbital_speed": "47.8 km/s",
        "orbital_inclination": "7 degree",
        "density": "5.427 g/cm³",
        "escape_velocity": "4.25 km/s",
        "reflectivity": "0.12"
    },
    "image": "https://upload.wikimedia.org/wikipedia/commons/b/b9/3D_Mercury.png",
    "gallery": [
        {
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4a/Mercury_in_true_color.jpg/290px-Mercury_in_true_color.jpg",
            "description": "Mercury in true color"
        },
        {
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/22/Mercury_with_magnetic_field.svg/1280px-Mercury_with_magnetic_field.svg.png",
            "description": "Mercury Internal Structure"
        },
        {
            "image": "https://upload.wikimedia.org/wikipedia/commons/2/2b/PIA19421-Mercury-Craters-MunchSanderPoe-20150416.jpg",
            "description": "Enhanced-color image of craters Munch (left), Sander (center), and Poe (right) amid volcanic plains (orange) near Caloris Basin"
        },
        {
            "image": "https://upload.wikimedia.org/wikipedia/commons/1/12/Terrestrial_planet_size_comparisons-2.jpg",
            "description": "Mercury to scale among the Inner Solar System planetary-mass objects beside the Sun, arranged by the order of their orbits outward from the Sun (from left: Mercury, Venus, Earth, the Moon, Mars and Ceres)"
        }
    ],
    "3d_model": "https://example.com/moon_3d_model",
    "parent_solar_system": "Solar System",
    "galaxy": "Milky Way",
    "interesting_facts": [
        "Mercury is the closest planet to the Sun, with an average distance of about 57.9 million kilometers (36 million miles).",
        "A year on Mercury (one orbit around the Sun) takes just 88 Earth days, making it the fastest planet in our solar system.",
        "Despite being closest to the Sun, Mercury is not the hottest planet; that title belongs to Venus due to its thick atmosphere.",
        "Mercury has a very thin atmosphere, composed mostly of oxygen, sodium, hydrogen, helium, and potassium.",
        "A day on Mercury (one full rotation) is very long, lasting approximately 59 Earth days.",
        "Mercury has a heavily cratered surface, similar to Earth's Moon, with large impact basins like the Caloris Basin.",
        "Due to its slow rotation and lack of atmosphere, temperatures on Mercury can swing from extremely hot (up to 430°C or 800°F) to extremely cold (down to -180°C or -290°F) within a single day.",
        "Mercury has no moons or rings.",
        "The planet's core makes up about 85% of its radius, making it one of the largest planetary cores relative to its size in the solar system.",
        "Mercury’s magnetic field is about 1% the strength of Earth's, suggesting its core is partially liquid.",
        "Mercury is named after the Roman messenger god, Mercury, known for his speed.",
        "The first spacecraft to visit Mercury was Mariner 10, which mapped about 45% of the planet’s surface in the 1970s.",
        "The MESSENGER spacecraft, which orbited Mercury from 2011 to 2015, provided detailed information about its composition and geological history.",
        "Mercury's surface is covered with smooth plains, high cliffs, and many impact craters.",
        "The planet's exosphere is created by particles knocked off its surface by the solar wind and micrometeorites.",
        "Mercury’s day-night cycle creates the most extreme temperature variation of any planet in the solar system.",
        "The planet’s small size and lack of atmosphere mean it has little ability to retain heat.",
        "Mercury has been known since ancient times and was observed by cultures such as the Sumerians, who referred to it around 3,000 BCE.",
        "The Caloris Basin, one of Mercury’s most notable features, is about 1,550 kilometers (960 miles) in diameter, formed by a massive impact.",
        "Due to its proximity to the Sun, observing Mercury with a telescope can be challenging, and it is often best seen during twilight.",
        "Mercury’s orbit is highly elliptical, varying its distance from the Sun significantly.",
        "Mercury’s surface contains large amounts of sulfur, which is unusual compared to other terrestrial planets.",
        "In Roman mythology, Mercury was also the god of commerce, travel, and thievery.",
        "Studies of Mercury provide insights into the formation and evolution of the inner planets in our solar system.",
        "Unlike Earth, Mercury does not have tectonic plates; its surface changes mainly through impacts and volcanic activity."
    ],
    "table2": {
        "title": "Atmospheric Composition",
        "data": {
            "Oxygen": "42%",
            "Sodium": "29%",
            "Hydrogen": "22%",
            "Helium": "6%",
            "Potassium": "0.5%",
            "Trace_Elements": "0.5%"
        }
    },
    "missions": [
        {
            "title": "Bepi Colombo Mission",
            "url": "https://en.wikipedia.org/wiki/BepiColombo",
            "launch_date": "20 Oct 2018",
            "active": "false"
        }
    ]
}