{
    "name": "Neptune",
    "name_theory": "Neptune is named after the Roman god of the sea. In Greek mythology, he is known as Poseidon.",
    "description": "Neptune is the eighth and farthest known planet from the Sun in the Solar System. It is the fourth-largest planet by diameter and the third-largest by mass. Neptune is a gas giant known for its deep blue color and strong winds.",
    "body_type": "Planet",
    "wiki_link": "https://en.wikipedia.org/wiki/Neptune",
    "table_stats": {
        "diameter": "49,244 km",
        "orbital_period": "164.8 years",
        "rotation_period": "16.11 hours",
        "surface_temperature": "-214°C",
        "distance_from_sun": "4.495 billion km",
        "distance_from_earth": "4.3 billion km (average)",
        "gravity": "11.15 m/s²",
        "magnetic_field": "27 times stronger than Earth's",
        "moon_count": "14",
        "length_of_day": "16.11 hours",
        "orbital_speed": "5.43 km/s",
        "orbital_inclination": "1.77 degrees",
        "density": "1.64 g/cm³",
        "escape_velocity": "23.5 km/s",
        "reflectivity": "0.41 (albedo)"
    },
    "image": "https://upload.wikimedia.org/wikipedia/commons/5/56/Neptune_Full.jpg",
    "gallery": [
        {
            "image": "https://upload.wikimedia.org/wikipedia/commons/5/56/Neptune_Full.jpg",
            "description": "Neptune in true color"
        },
        {
            "image": "https://upload.wikimedia.org/wikipedia/commons/1/13/Neptune_clouds.jpg",
            "description": "Enhanced color image of Neptune's clouds"
        },
        {
            "image": "https://upload.wikimedia.org/wikipedia/commons/d/da/Neptune_rings.jpg",
            "description": "Neptune's rings captured by Voyager 2"
        },
        {
            "image": "https://upload.wikimedia.org/wikipedia/commons/3/3d/Triton_moon_mosaic.jpg",
            "description": "Triton, Neptune's largest moon"
        }
    ],
    "3d_model": "https://example.com/neptune_3d_model",
    "parent_solar_system": "Solar System",
    "galaxy": "Milky Way",
    "interesting_facts": [
        "Neptune was the first planet to be discovered by mathematical predictions rather than through direct observation.",
        "It is known for its deep blue color, caused by the absorption of red light by methane in the atmosphere.",
        "Neptune has the strongest winds of any planet in the Solar System, with speeds reaching up to 2,100 kilometers per hour.",
        "The planet has a faint and fragmented ring system composed of dust and ice particles.",
        "Neptune's largest moon, Triton, is unique due to its retrograde orbit, indicating it may have been captured by Neptune's gravity.",
        "Triton has geysers that spew nitrogen gas, making it one of the few geologically active moons in the Solar System.",
        "Neptune's atmosphere consists mostly of hydrogen, helium, and methane, with trace amounts of water and ammonia.",
        "The planet's interior is thought to be composed of a core of rock and metal, surrounded by a mantle of water, ammonia, and methane ices.",
        "Neptune's magnetic field is tilted and offset from the planet's center, similar to Uranus.",
        "The planet has several dark spots similar to Jupiter's Great Red Spot, which are thought to be storms.",
        "Voyager 2 is the only spacecraft to have visited Neptune, providing valuable data during its flyby in 1989.",
        "Neptune has a dynamic climate, with large-scale storms and weather patterns changing over time.",
        "The planet's outer atmosphere is characterized by high-altitude clouds of methane ice crystals.",
        "Neptune has 14 known moons, with Triton being the largest and most studied.",
        "The planet's rings are named after astronomers who made significant contributions to Neptune's discovery and study."
    ],
    "table2": {
        "title": "Atmospheric Composition",
        "data": {
            "Hydrogen": "80.0%",
            "Helium": "19.0%",
            "Methane": "1.5%",
            "Ammonia": "trace",
            "Water": "trace"
        }
    },
    "missions": [
        {
            "title": "Voyager 2",
            "url": "https://en.wikipedia.org/wiki/Voyager_2",
            "launch_date": "20 August 1977",
            "active": "true"
        }
    ]
}
