{
    "name": "Uranus",
    "name_theory": "Uranus is named after the ancient Greek deity of the sky, Uranus, the father of Cronus (Saturn) and grandfather of Zeus (Jupiter).",
    "description": "Uranus is the seventh planet from the Sun and the third-largest in diameter in the Solar System. It is an ice giant with a blue-green color due to methane in its atmosphere.",
    "body_type": "Planet",
    "wiki_link": "https://en.wikipedia.org/wiki/Uranus",
    "table_stats": {
        "diameter": "50,724 km",
        "orbital_period": "84 years",
        "rotation_period": "17.24 hours",
        "surface_temperature": "-224°C",
        "distance_from_sun": "2.871 billion km",
        "distance_from_earth": "2.6 billion km (average)",
        "gravity": "8.69 m/s²",
        "magnetic_field": "75 times stronger than Earth's",
        "moon_count": "27",
        "length_of_day": "17.24 hours",
        "orbital_speed": "6.81 km/s",
        "orbital_inclination": "0.77 degrees",
        "density": "1.27 g/cm³",
        "escape_velocity": "21.3 km/s",
        "reflectivity": "0.30 (albedo)"
    },
    "image": "https://upload.wikimedia.org/wikipedia/commons/3/3d/Uranus2.jpg",
    "gallery": [
        {
            "image": "https://upload.wikimedia.org/wikipedia/commons/3/3d/Uranus2.jpg",
            "description": "Uranus in true color"
        },
        {
            "image": "https://upload.wikimedia.org/wikipedia/commons/8/8a/Uranus_clouds.jpg",
            "description": "Enhanced color image of Uranus showing its cloud structure"
        },
        {
            "image": "https://upload.wikimedia.org/wikipedia/commons/a/a4/Uranus_rings_scheme.png",
            "description": "Diagram of Uranus's ring system"
        },
        {
            "image": "https://upload.wikimedia.org/wikipedia/commons/d/df/Uranus.jpg",
            "description": "Hubble Space Telescope image of Uranus"
        }
    ],
    "3d_model": "https://example.com/uranus_3d_model",
    "parent_solar_system": "Solar System",
    "galaxy": "Milky Way",
    "interesting_facts": [
        "Uranus is unique in that it rotates on its side, with an axial tilt of 98 degrees relative to its orbit, resulting in extreme seasonal variations.",
        "It is often referred to as an 'ice giant' due to the presence of water, ammonia, and methane ices in its composition.",
        "The blue-green color of Uranus is due to the absorption of red light by methane in the upper atmosphere.",
        "Uranus has a faint ring system composed of dark, narrow rings primarily made of ice and dust particles.",
        "The planet has 27 known moons, with Titania, Oberon, Umbriel, Ariel, and Miranda being the largest.",
        "Uranus's magnetic field is tilted at an angle of 59 degrees from its rotational axis and is off-center from the planet's core.",
        "The average temperature of Uranus's atmosphere is about -224°C, making it the coldest planet in the Solar System.",
        "Despite its size, Uranus is less dense than Earth, with a density of about 1.27 g/cm³.",
        "Uranus's atmosphere is composed mostly of hydrogen and helium, with a higher proportion of 'ices' such as water, ammonia, and methane.",
        "The Voyager 2 spacecraft is the only mission to have visited Uranus, providing valuable data during its flyby in 1986.",
        "Uranus has a relatively featureless appearance compared to other gas giants, with few visible cloud patterns or storms.",
        "The planet's ring system was discovered in 1977 during a stellar occultation, when it blocked the light of a star.",
        "Uranus has a significant tilt in its magnetic field, leading to complex and unusual magnetospheric dynamics.",
        "The planet's interior is thought to consist of a rocky core surrounded by a mantle of water, ammonia, and methane ices.",
        "Uranus's extreme axial tilt is believed to be the result of a massive collision with an Earth-sized object early in its history."
    ],
    "table2": {
        "title": "Atmospheric Composition",
        "data": {
            "Hydrogen": "82.5%",
            "Helium": "15.2%",
            "Methane": "2.3%",
            "Ammonia": "trace",
            "Water": "trace"
        }
    },
    "missions": [
        {
            "title": "Voyager 2",
            "url": "https://en.wikipedia.org/wiki/Voyager_2",
            "launch_date": "20 August 1977",
            "active": "true"
        }
    ]
}
