{
    "name": "Venus",
    "name_theory": "Venus is named after the Roman goddess of love and beauty. It is the only planet in the Solar System named after a female deity. This naming is likely due to its brightness and visibility in the sky, which made it a prominent object for ancient astronomers.",
    "description": "Venus is the second planet from the Sun and is often called Earth's sister planet due to their similar size and composition. However, Venus has an extremely thick atmosphere, surface temperatures hot enough to melt lead, and crushing atmospheric pressure.",
    "body_type": "Planet",
    "wiki_link": "https://en.wikipedia.org/wiki/Venus",
    "table_stats": {
        "diameter": "12,104 km",
        "orbital_period": "225 days",
        "rotation_period": "243 days (retrograde)",
        "surface_temperature": "462°C",
        "distance_from_sun": "108.2 million km",
        "distance_from_earth": "41 million km",
        "gravity": "90% of Earth",
        "magnetic_field": "Very weak",
        "moon_count": "0",
        "length_of_day": "117 Earth days",
        "orbital_speed": "35.02 km/s",
        "orbital_inclination": "3.39 degrees",
        "density": "5.243 g/cm³",
        "escape_velocity": "10.36 km/s",
        "reflectivity": "0.65 (high albedo due to cloud cover)"
    },
    "image": "https://upload.wikimedia.org/wikipedia/commons/e/e5/Venus-real_color.jpg",
    "gallery": [
        {
            "image": "https://upload.wikimedia.org/wikipedia/commons/e/e5/Venus-real_color.jpg",
            "description": "Venus in real color"
        },
        {
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a1/Venus_globe.jpg/290px-Venus_globe.jpg",
            "description": "Venus globe showing surface details"
        },
        {
            "image": "https://upload.wikimedia.org/wikipedia/commons/8/85/Magellan_Venus_globe.jpg",
            "description": "3D representation of Venus surface by Magellan mission"
        },
        {
            "image": "https://upload.wikimedia.org/wikipedia/commons/7/73/Venus_pioneer_uv.jpg",
            "description": "Venus in ultraviolet by Pioneer Venus Orbiter"
        }
    ],
    "3d_model": "https://example.com/venus_3d_model",
    "parent_solar_system": "Solar System",
    "galaxy": "Milky Way",
    "interesting_facts": [
        "Venus is the hottest planet in our solar system, with surface temperatures around 462°C (864°F) due to its thick atmosphere composed mainly of carbon dioxide, which creates a strong greenhouse effect.",
        "A day on Venus (one rotation on its axis) is longer than a year on Venus (one orbit around the Sun). It takes about 243 Earth days to rotate once but only about 225 Earth days to complete an orbit.",
        "Venus rotates in the opposite direction to most planets in the Solar System. This retrograde rotation means that, on Venus, the Sun rises in the west and sets in the east.",
        "The atmospheric pressure on Venus is about 92 times greater than Earth's, equivalent to the pressure found 900 meters underwater on Earth.",
        "Venus has no moons or rings.",
        "The surface of Venus is covered with volcanoes and deformed mountains. Over 1600 major volcanoes or volcanic features are known, and some may still be active.",
        "Venus has the longest rotation period (day length) of any planet in the Solar System.",
        "Venus is often called Earth's twin because of its similar size and proximity to Earth, but its environment is drastically different.",
        "Venus is shrouded in thick clouds of sulfuric acid, making it impossible to view its surface with optical telescopes.",
        "Space missions to Venus include Venera (Soviet Union), Pioneer Venus (NASA), Magellan (NASA), and Akatsuki (Japan).",
        "Venus's high albedo (reflectivity) makes it the brightest planet in the night sky, visible even during daylight under the right conditions.",
        "Venus has no magnetic field, likely due to its slow rotation.",
        "The first successful flyby of Venus was by NASA's Mariner 2 spacecraft in 1962.",
        "The Venera missions by the Soviet Union were the first to land on Venus and send back images of the surface, with Venera 7 being the first successful landing in 1970.",
        "Venus's thick atmosphere and sulfuric acid clouds create a greenhouse effect that keeps temperatures extremely high and consistent across the planet, both day and night."
    ],
    "table2": {
        "title": "Atmospheric Composition",
        "data": {
            "Carbon Dioxide": "96.5%",
            "Nitrogen": "3.5%",
            "Sulfur Dioxide": "Trace",
            "Water Vapor": "Trace",
            "Carbon Monoxide": "Trace",
            "Argon": "Trace",
            "Helium": "Trace",
            "Neon": "Trace"
        }
    },
    "missions": [
        {
            "title": "Akatsuki",
            "url": "https://en.wikipedia.org/wiki/Akatsuki_(spacecraft)",
            "launch_date": "20 May 2010",
            "active": "true"
        },
        {
            "title": "Magellan",
            "url": "https://en.wikipedia.org/wiki/Magellan_(spacecraft)",
            "launch_date": "4 May 1989",
            "active": "false"
        },
        {
            "title": "Venera Program",
            "url": "https://en.wikipedia.org/wiki/Venera",
            "launch_date": "1961 - 1984",
            "active": "false"
        }
    ]
}